// 定义密钥
const CryptoJS = require("crypto-js")
const key = CryptoJS.enc.Utf8.parse("jdnyjym2023wmudrpoilcsxq"); // 32字节
  // 解密函数
function Decrypt(ciphertext) {
  if(!ciphertext){
    return null;
  }

  const decrypt = CryptoJS.AES.decrypt(ciphertext, key, {
    mode:CryptoJS.mode.ECB,
    padding: CryptoJS.pad.Pkcs7
  });
  const decryptedStr = decrypt.toString(CryptoJS.enc.Utf8)
  return decryptedStr.toString();
}

function Encrypt(data) {
  if(!data){
    return '';
  }
  const encrypted = CryptoJS.AES.encrypt(data, key, {
    mode: CryptoJS.mode.ECB,
    padding: CryptoJS.pad.Pkcs7
  }).toString();
  return encrypted
}

// 测试
// const plaintext = "李四";
// const encrypted = Encrypt(plaintext);
// console.log("加密结果:", encrypted);

// console.log("解密结果:", Decrypt(encrypted));

  const name = [
    "赵文辉", "钱敏静", "孙昊磊", "李俊杰", "周雪玲",
    "吴志超", "郑雨彤", "王瑞阳", "冯雅欣", "陈逸飞",
    "褚天宇", "卫思涵", "蒋云龙", "韩明轩", "罗子墨",
    "杨诗琪", "朱浩宇", "秦雨薇", "尤子轩", "许嘉怡",
    "何俊熙", "吕梦瑶", "施宇航", "张欣妍", "孔一鸣",
    "曹雨欣", "严博文", "华晨旭", "金思远", "魏雨桐",
    "陶浩然", "姜悦琳", "戚俊杰", "谢雨萱", "邹逸凡",
    "喻文昊", "柏晨曦", "水若兰", "窦一航", "章梓涵",
    "云景轩", "苏沐阳", "潘诗雨", "葛天佑", "奚雨辰",
    "范明哲", "彭雅雯", "郎子墨", "鲁思睿", "韦欣怡",
    "昌浩轩", "马雨欣", "苗一诺", "凤俊豪", "花雨菲",
    "方梓轩", "俞文博", "任嘉悦", "袁浩宇", "柳思琪",
    "酆雨泽", "鲍明轩", "史若曦", "唐宇航", "费俊杰",
    "廉雨彤", "岑浩博", "薛雅婷", "雷天宇", "贺雨萌",
    "倪子涵", "汤晨阳", "滕欣悦", "殷明哲", "罗思雨",
    "毕浩轩", "郝雨欣", "邬俊杰", "安若琳", "常宇航",
    "乐雨菲", "于文昊", "时嘉怡", "傅浩宇", "皮思涵",
    "卞雨辰", "康雅欣", "伍俊豪", "余若曦", "元浩博", 
    "卜雨彤", "顾子轩", "孟诗琪", "平宇航", "萧雨欣",
    "黄雨萱", "和俊杰", "穆思远", "萧嘉悦", "尹浩轩"
  ];
  const result = [];
  for(let i = 0; i < name.length; i++){
    const encrypted = Encrypt(name[i]);
    result[i] = encrypted;
    //console.log('"'+encrypted+'"'+',');
  }
  //console.log(result);

  const phone = [
    "15030933419",
    "18564642039",
    "13324035785", 
    "13760587615",
    "18036715229",
    "18530916494",
    "13366355290",
    "15231854351",
    "17133923408",
    "18996223808",
    "13805291024",
    "16556402469",
    "15727897499",
    "13330717057", 
    "15512836853",
    "18591718718",
    "13497545000",
    "17726152346",
    "13627454660",
    "15733665549",
    "18410438806",
    "13546041326",
    "17568215800",
    "17175632238",
    "13431637224",
    "13742301236",
    "13127727005",
    "16570092557",
    "13525254523",
    "18513863807",
    "13201237605",
    "13887493093",
    "13468652382",
    "17872084807",
    "18139906559",
    "18775266755",
    "13805215941",
    "19864903283",
    "15847678966",
    "17367541873",
    "17291502192",
    "18494057865",
    "13173156186",
    "17350288993",
    "18224286302",
    "18575349019",
    "18863345441",
    "18168947734",
    "15701878623",
    "15182222224",
    "15166708365",
    "18968412857",
    "15806859310",
    "13324074433",
    "13215092226",
    "19849568871",
    "18852164984",
    "15247992293",
    "18967489734",
    "13684045609",
    "19825641428",
    "17683909168",
    "13784384742",
    "14721907337",
    "15573697519",
    "17515544557",
    "17633976770",
    "19856307916",
    "18261804994",
    "16536134067",
    "13733805218",
    "15375521740",
    "17892809375",
    "17527559874",
    "18345162564",
    "15273829923",
    "17751462169",
    "15794615813",
    "16531167005",
    "17783099629",
    "15778815499",
    "15706135407",
    "15870322165",
    "16573844525",
    "18784136447",
    "14571724528",
    "15321291091",
    "17762273364",
    "15579874847",
    "18575175144",
    "17705542130",
    "15702512747",
    "18822682816",
    "13627019395",
    "15525647340",
    "13147721720",
    "13193285822",
    "17378763843",
    "15173819989",
    "13411132768"
  ]

  const result_phone = [];
  console.log('// 手机号');
  for(let i = 0; i < phone.length; i++){
    const encrypted = Encrypt(phone[i]);
    result_phone[i] = encrypted;
    console.log('"'+encrypted+'"'+',');
  }